/* cuts */
/* 2 */
p1(1).
p1(2):-!.
p1(3).
/* בתהליך החישוב של השאילתה מנסה פרולוג למצוא הצבה שתספק את X (נמצא אחד שכזה -> X=1). לאחר מכן משמעות סימן הקריאה הינו שמעתה ערכו של X לא ישתנה (לא יבוצע backtracking מנקודה זאת) ולאחר מכן מנסה פרולוג למצוא הצבה שתספק את Y וכמובן שגם כזאת נמצאת Y=1.									*/

/* 3 a */
/* ה-CUT בתכנית מספר אחת הינו GREEN CUT מכיון שהחוקים הינם זרים זה לזה ולכן אם מתקיים ש-X קטן משלוש התנאי השני ממילא לא מתקיים ולכן אין משמעות לכך שלא נאפשר את בדיקת התנאי השני.
לעומת זאת, בתכנית השנייה החוקים אינם זרים, ולכן גם אם מתקיים ש-X קטן משלוש יכולה להיות השמה שתספק את התוכנית בהתאם לחוק השני בלבד אך זה כלל אינו נבדק ברגע שמתקיים כי X קטן משלוש	 */
p2(X,Y):-X<3,!,Y=5.
p2(X,Y):-X>=3,Y=7.
/* */
/* 3 b */
p3(X,Y):-X<3,!,Y=5.
p3(X,Y):-Y=7.

